%x1-x3,y1-y3基站位置  t1-t3 时间差   v 速度
n=0;
xa=0;
ya=0;
for i=1:10000
    for j=1:10000
        w1=(((i-x1)^2-(j-y1)^2)^0.5-((i-x2)^2-(j-y2)^2)^0.5);
        if  (w1<t1*v*1.05) && (w1>t1*v*0.95)
            w2=(((i-x1)^2-(j-y1)^2)^0.5-((i-x3)^2-(j-y3)^2)^0.5);
            if (w2<t2*v*1.05) && (w2>t2*v*0.95)
                w3=(((i-x2)^2-(j-y2)^2)^0.5-((i-x3)^2-(j-y3)^2)^0.5);
                if (w3<t3*v*1.05) && (w3>t3*v*0.95)
                    xa=xa+i;
                    ya=ya+j;
                    n=n+1;
                end
            end
        end
    end
end
xf=xa\n;
yf=ya\n;                    